# IsWithFitting Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitType..::..IsWithFitting Property
ConduitType Class See Also
---
Whether this conduit type is with fitting
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsWithFitting { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsWithFitting As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsWithFitting {
	bool get ();
}
```

# Remarks
True if this conduit type is with fitting type.
# See Also
ConduitType Class
Autodesk.Revit.DB.Electrical Namespace